/*
Navicat Oracle Data Transfer
Oracle Client Version : 10.2.0.5.0

Source Server         : jsd1710
Source Server Version : 100200
Source Host           : localhost:1521
Source Schema         : JSD1710

Target Server Type    : ORACLE
Target Server Version : 100200
File Encoding         : 65001

Date: 2018-03-31 16:42:00
*/


-- ----------------------------
-- Table structure for TBL_SPECIALTY
-- ----------------------------
DROP TABLE "JSD1710"."TBL_SPECIALTY";
CREATE TABLE "JSD1710"."TBL_SPECIALTY" (
"ID" NUMBER(7) NOT NULL ,
"SPENAME" VARCHAR2(255 BYTE) NOT NULL ,
"PRODUCTPARAMENTERS" VARCHAR2(255 BYTE) NOT NULL ,
"FACTORYNAME" VARCHAR2(255 BYTE) NOT NULL ,
"FACTORYPHONE" VARCHAR2(255 BYTE) NOT NULL ,
"STROAGEMETOD" VARCHAR2(255 BYTE) NOT NULL ,
"FOODADDITIVES" VARCHAR2(255 BYTE) NOT NULL ,
"SERIES" VARCHAR2(255 BYTE) NOT NULL ,
"WEIGHT" VARCHAR2(255 BYTE) NOT NULL ,
"RANK" VARCHAR2(255 BYTE) NOT NULL ,
"PRODUCTDATE" DATE NOT NULL ,
"PRODUCTCODE" VARCHAR2(255 BYTE) NOT NULL ,
"FACTORYADDRESS" VARCHAR2(255 BYTE) NOT NULL ,
"BURDENSHEET" VARCHAR2(255 BYTE) NOT NULL ,
"EXPIRATIONDATE" VARCHAR2(255 BYTE) NOT NULL ,
"PACHING" VARCHAR2(255 BYTE) NOT NULL ,
"BARCODE" VARCHAR2(255 BYTE) NOT NULL ,
"ORGANISM" VARCHAR2(255 BYTE) NOT NULL ,
"ORIGIN" VARCHAR2(255 BYTE) NOT NULL ,
"PREFERENTIALPRICE" NUMBER(8,2) NOT NULL ,
"DISTRIBUTION" VARCHAR2(255 BYTE) NOT NULL ,
"COURIERFEES" NUMBER(8,2) NOT NULL ,
"MONTHLYSALES" VARCHAR2(255 BYTE) NOT NULL ,
"EVALUATION" VARCHAR2(255 BYTE) NOT NULL ,
"INTRODUCTION" VARCHAR2(255 BYTE) NOT NULL ,
"IMAGES" VARCHAR2(255 BYTE) NOT NULL ,
"SHOPPRICE" NUMBER(8,2) NOT NULL ,
"NUMBERNO" VARCHAR2(255 BYTE) NOT NULL 
)
LOGGING
NOCOMPRESS
NOCACHE

;

-- ----------------------------
-- Records of TBL_SPECIALTY
-- ----------------------------
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('1', '高油鸭蛋', '650117020039', '扬州高油鸭蛋有限公司加工厂', '13838438', '置于阴凉干燥处 ', '无', '高油鸭蛋特级500g 一捆', '500g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '扬州105号367院内房屋', '鸭蛋', '180天', '袋装', '650117020039', '否', '1', '55', '江苏 苏州', '5', '3000捆', '4.5分', '油多，下饭菜', '高油鸭蛋.jpg', '179', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('2', '阳澄湖大闸蟹', '5867020039', '阳澄湖大闸蟹有限公司加工厂', '54638438', '置于阴凉干燥处 ', '无', '阳澄湖大闸蟹4个 一捆', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '大闸蟹', '180天', '袋装', '650117020039', '否', '1', '75', '江苏 苏州', '6', '9000捆', '9.5分', '个大，新鲜', '阳澄湖大闸蟹.jpg', '45', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('3', '麦芽糖', '3457020039', '江苏麦芽糖有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '麦芽糖 一袋', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '小麦', '180天', '袋装', '650117020039', '否', '1', '82', '江苏 苏州', '3', '9000袋', '7.5分', '味道香甜', '麦芽糖.jpg', '220', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('4', '八义集豆腐乳', '3457020039', '江苏八义集豆腐乳有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '豆腐乳 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '佬豆腐', '180天', '盒装', '650117020039', '否', '1', '15', '江苏 南京', '8', '7000袋', '5.5分', '飘香四溢 香辣可口', '八义集豆腐乳.jpg', '136', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('5', '江苏淮饺', '3457020039', '江苏淮饺有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '江苏淮饺 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '小麦，猪肉', '180天', '盒装', '650117020039', '否', '2', '65', '江苏 南京', '8', '7000袋', '5.5分', '飘香四溢 垂涎三尺', '江苏淮饺.jpg', '150', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('6', '江苏小笼包', '3457020039', '江苏小笼包有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '江苏小笼包 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '小麦，猪肉', '180天', '盒装', '650117020039', '否', '2', '35', '江苏 南京', '9', '4000袋', '5.5分', '飘香四溢 晶莹剔透', '江苏小笼包.jpg', '410', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('7', '毛脸凉粉', '3457020039', '江苏毛脸凉粉有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '毛脸凉粉 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '小麦，凉粉', '180天', '盒装', '650117020039', '否', '2', '58', '江苏 连云港', '8', '4000袋', '5.5分', '飘香四溢 旷世绝辣', '连云港-毛脸凉粉.jpg', '100', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('8', '石梁湖葡萄', '3457020039', '江苏石梁湖葡萄有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '石梁湖葡萄 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '连云港葡萄', '180天', '盒装', '650117020039', '否', '2', '35', '江苏 连云港', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '连云港特产-石梁湖葡萄.jpg', '459', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('9', '南京樱桃鸭', '3457020039', '江苏南京樱桃鸭有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '南京樱桃鸭 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '鸭', '180天', '盒装', '650117020039', '否', '3', '95', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '南京樱桃鸭.jpg', '456', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('10', '南通门山羊肉', '3457020039', '江苏南通门山羊肉有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '南通门山羊肉 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '羊肉', '180天', '盒装', '650117020039', '否', '3', '795', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '南通门山羊肉.jpg', '105', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('11', '苏州白鱼', '3457020039', '江苏苏州白鱼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '苏州白鱼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '苏州白鱼', '180天', '盒装', '650117020039', '否', '3', '135', '江苏 苏州', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '苏州白鱼.jpg', '300', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('12', '泰兴黄桥烧饼', '3457020039', '江苏泰兴黄桥烧饼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '泰兴黄桥烧饼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '面粉，猪肉', '180天', '盒装', '650117020039', '否', '3', '35', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '泰兴黄桥烧饼.jpg', '567', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('13', '盐水鸭', '3457020039', '江苏南京盐水鸭有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '盐水鸭 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '鸭', '180天', '盒装', '650117020039', '否', '4', '34', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '盐水鸭.jpg', '230', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('14', '粽子糖', '3457020039', '江苏粽子糖有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '粽子糖 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '糖浆', '180天', '盒装', '650117020039', '否', '4', '24', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '粽子糖.jpg', '235', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('15', '毛脸凉粉', '3457020039', '江苏毛脸凉粉有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '毛脸凉粉 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '小麦，凉粉', '180天', '盒装', '650117020039', '否', '0', '58', '江苏 连云港', '8', '4000袋', '5.5分', '飘香四溢 旷世绝辣', '连云港-毛脸凉粉.jpg', '100', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('16', '石梁湖葡萄', '3457020039', '江苏石梁湖葡萄有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '石梁湖葡萄 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '连云港葡萄', '180天', '盒装', '650117020039', '否', '0', '35', '江苏 连云港', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '连云港特产-石梁湖葡萄.jpg', '459', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('17', '南京樱桃鸭', '3457020039', '江苏南京樱桃鸭有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '南京樱桃鸭 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '鸭', '180天', '盒装', '650117020039', '否', '0', '95', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '南京樱桃鸭.jpg', '456', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('18', '南通门山羊肉', '3457020039', '江苏南通门山羊肉有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '南通门山羊肉 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '羊肉', '180天', '盒装', '650117020039', '否', '0', '795', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '南通门山羊肉.jpg', '105', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('19', '苏州白鱼', '3457020039', '江苏苏州白鱼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '苏州白鱼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '苏州白鱼', '180天', '盒装', '650117020039', '否', '6', '135', '江苏 苏州', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '苏州白鱼.jpg', '300', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('20', '泰兴黄桥烧饼', '3457020039', '江苏泰兴黄桥烧饼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '泰兴黄桥烧饼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '面粉，猪肉', '180天', '盒装', '650117020039', '否', '7', '35', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '泰兴黄桥烧饼.jpg', '567', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('21', '盐水鸭', '3457020039', '江苏南京盐水鸭有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '盐水鸭 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '鸭', '180天', '盒装', '650117020039', '否', '5', '34', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '盐水鸭.jpg', '230', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('22', '粽子糖', '3457020039', '江苏粽子糖有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '粽子糖 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '糖浆', '180天', '盒装', '650117020039', '否', '8', '24', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '粽子糖.jpg', '235', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('23', '南通门山羊肉', '3457020039', '江苏南通门山羊肉有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '南通门山羊肉 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '羊肉', '180天', '盒装', '650117020039', '否', '9', '795', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '南通门山羊肉.jpg', '105', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('24', '苏州白鱼', '3457020039', '江苏苏州白鱼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '苏州白鱼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '苏州白鱼', '180天', '盒装', '650117020039', '否', '10', '135', '江苏 苏州', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '苏州白鱼.jpg', '300', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('25', '泰兴黄桥烧饼', '3457020039', '江苏泰兴黄桥烧饼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '泰兴黄桥烧饼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '面粉，猪肉', '180天', '盒装', '650117020039', '否', '11', '35', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '泰兴黄桥烧饼.jpg', '567', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('26', '盐水鸭', '3457020039', '江苏南京盐水鸭有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '盐水鸭 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '鸭', '180天', '盒装', '650117020039', '否', '5', '34', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '盐水鸭.jpg', '230', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('27', '粽子糖', '3457020039', '江苏粽子糖有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '粽子糖 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '糖浆', '180天', '盒装', '650117020039', '否', '12', '24', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '粽子糖.jpg', '235', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('28', '苏州白鱼', '3457020039', '江苏苏州白鱼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '苏州白鱼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '苏州白鱼', '180天', '盒装', '650117020039', '否', '13', '135', '江苏 苏州', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '苏州白鱼.jpg', '300', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('29', '泰兴黄桥烧饼', '3457020039', '江苏泰兴黄桥烧饼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '泰兴黄桥烧饼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '面粉，猪肉', '180天', '盒装', '650117020039', '否', '14', '35', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '泰兴黄桥烧饼.jpg', '567', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('30', '盐水鸭', '3457020039', '江苏南京盐水鸭有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '盐水鸭 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '鸭', '180天', '盒装', '650117020039', '否', '15', '34', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '盐水鸭.jpg', '230', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('31', '粽子糖', '3457020039', '江苏粽子糖有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '粽子糖 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '糖浆', '180天', '盒装', '650117020039', '否', '16', '24', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '粽子糖.jpg', '235', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('32', '苏州白鱼', '3457020039', '江苏苏州白鱼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '苏州白鱼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '苏州白鱼', '180天', '盒装', '650117020039', '否', '17', '135', '江苏 苏州', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '苏州白鱼.jpg', '300', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('33', '泰兴黄桥烧饼', '3457020039', '江苏泰兴黄桥烧饼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '泰兴黄桥烧饼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '面粉，猪肉', '180天', '盒装', '650117020039', '否', '18', '35', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '泰兴黄桥烧饼.jpg', '567', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('34', '盐水鸭', '3457020039', '江苏南京盐水鸭有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '盐水鸭 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '鸭', '180天', '盒装', '650117020039', '否', '19', '34', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '盐水鸭.jpg', '230', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('35', '粽子糖', '3457020039', '江苏粽子糖有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '粽子糖 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '糖浆', '180天', '盒装', '650117020039', '否', '20', '24', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '粽子糖.jpg', '235', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('36', '苏州白鱼', '3457020039', '江苏苏州白鱼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '苏州白鱼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '苏州白鱼', '180天', '盒装', '650117020039', '否', '21', '135', '江苏 苏州', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '苏州白鱼.jpg', '300', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('37', '泰兴黄桥烧饼', '3457020039', '江苏泰兴黄桥烧饼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '泰兴黄桥烧饼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '面粉，猪肉', '180天', '盒装', '650117020039', '否', '22', '35', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '泰兴黄桥烧饼.jpg', '567', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('38', '盐水鸭', '3457020039', '江苏南京盐水鸭有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '盐水鸭 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '鸭', '180天', '盒装', '650117020039', '否', '23', '34', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '盐水鸭.jpg', '230', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('39', '粽子糖', '3457020039', '江苏粽子糖有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '粽子糖 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '糖浆', '180天', '盒装', '650117020039', '否', '24', '24', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '粽子糖.jpg', '235', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('40', '苏州白鱼', '3457020039', '江苏苏州白鱼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '苏州白鱼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '苏州白鱼', '180天', '盒装', '650117020039', '否', '25', '135', '江苏 苏州', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '苏州白鱼.jpg', '300', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('41', '泰兴黄桥烧饼', '3457020039', '江苏泰兴黄桥烧饼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '泰兴黄桥烧饼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '面粉，猪肉', '180天', '盒装', '650117020039', '否', '26', '35', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '泰兴黄桥烧饼.jpg', '567', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('42', '盐水鸭', '3457020039', '江苏南京盐水鸭有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '盐水鸭 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '鸭', '180天', '盒装', '650117020039', '否', '27', '34', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '盐水鸭.jpg', '230', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('43', '粽子糖', '3457020039', '江苏粽子糖有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '粽子糖 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:43', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '糖浆', '180天', '盒装', '650117020039', '否', '28', '24', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '粽子糖.jpg', '235', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('44', '苏州白鱼', '3457020039', '江苏苏州白鱼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '苏州白鱼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:44', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '苏州白鱼', '180天', '盒装', '650117020039', '否', '29', '135', '江苏 苏州', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '苏州白鱼.jpg', '300', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('45', '泰兴黄桥烧饼', '3457020039', '江苏泰兴黄桥烧饼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '泰兴黄桥烧饼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:44', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '面粉，猪肉', '180天', '盒装', '650117020039', '否', '30', '35', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '泰兴黄桥烧饼.jpg', '567', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('46', '盐水鸭', '3457020039', '江苏南京盐水鸭有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '盐水鸭 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:44', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '鸭', '180天', '盒装', '650117020039', '否', '31', '34', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '盐水鸭.jpg', '230', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('47', '粽子糖', '3457020039', '江苏粽子糖有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '粽子糖 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:44', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '糖浆', '180天', '盒装', '650117020039', '否', '32', '24', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '粽子糖.jpg', '235', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('48', '苏州白鱼', '3457020039', '江苏苏州白鱼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '苏州白鱼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:44', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '苏州白鱼', '180天', '盒装', '650117020039', '否', '33', '135', '江苏 苏州', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '苏州白鱼.jpg', '300', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('49', '泰兴黄桥烧饼', '3457020039', '江苏泰兴黄桥烧饼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '泰兴黄桥烧饼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:44', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '面粉，猪肉', '180天', '盒装', '650117020039', '否', '34', '35', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '泰兴黄桥烧饼.jpg', '567', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('50', '盐水鸭', '3457020039', '江苏南京盐水鸭有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '盐水鸭 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:44', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '鸭', '180天', '盒装', '650117020039', '否', '35', '34', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '盐水鸭.jpg', '230', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('51', '粽子糖', '3457020039', '江苏粽子糖有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '粽子糖 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:44', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '糖浆', '180天', '盒装', '650117020039', '否', '36', '24', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '粽子糖.jpg', '235', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('52', '苏州白鱼', '3457020039', '江苏苏州白鱼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '苏州白鱼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:44', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '苏州白鱼', '180天', '盒装', '650117020039', '否', '37', '135', '江苏 苏州', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '苏州白鱼.jpg', '300', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('53', '泰兴黄桥烧饼', '3457020039', '江苏泰兴黄桥烧饼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '泰兴黄桥烧饼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:44', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '面粉，猪肉', '180天', '盒装', '650117020039', '否', '38', '35', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '泰兴黄桥烧饼.jpg', '567', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('54', '盐水鸭', '3457020039', '江苏南京盐水鸭有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '盐水鸭 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:44', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '鸭', '180天', '盒装', '650117020039', '否', '39', '34', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '盐水鸭.jpg', '230', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('55', '粽子糖', '3457020039', '江苏粽子糖有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '粽子糖 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:44', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '糖浆', '180天', '盒装', '650117020039', '否', '40', '24', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '粽子糖.jpg', '235', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('56', '苏州白鱼', '3457020039', '江苏苏州白鱼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '苏州白鱼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:44', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '苏州白鱼', '180天', '盒装', '650117020039', '否', '40', '135', '江苏 苏州', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '苏州白鱼.jpg', '300', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('57', '泰兴黄桥烧饼', '3457020039', '江苏泰兴黄桥烧饼有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '泰兴黄桥烧饼 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:44', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '面粉，猪肉', '180天', '盒装', '650117020039', '否', '41', '35', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '泰兴黄桥烧饼.jpg', '567', '江苏 苏州');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('58', '盐水鸭', '3457020039', '江苏南京盐水鸭有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '盐水鸭 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:44', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '鸭', '180天', '盒装', '650117020039', '否', '41', '34', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '盐水鸭.jpg', '230', '江苏 南京');
INSERT INTO "JSD1710"."TBL_SPECIALTY" VALUES ('59', '粽子糖', '3457020039', '江苏粽子糖有限公司加工厂', '8638438', '置于阴凉干燥处 ', '无', '粽子糖 一盒', '1000g', '特级', TO_DATE('2018-03-23 11:26:44', 'YYYY-MM-DD HH24:MI:SS'), 'GB/T5835', '苏州105号367院内房屋', '糖浆', '180天', '盒装', '650117020039', '否', '39', '24', '江苏 南京', '8', '4000袋', '7.2分', '飘香四溢 新鲜', '粽子糖.jpg', '235', '江苏 南京');

-- ----------------------------
-- Indexes structure for table TBL_SPECIALTY
-- ----------------------------

-- ----------------------------
-- Checks structure for table TBL_SPECIALTY
-- ----------------------------
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("SPENAME" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("PRODUCTPARAMENTERS" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("FACTORYNAME" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("FACTORYPHONE" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("STROAGEMETOD" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("FOODADDITIVES" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("SERIES" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("WEIGHT" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("RANK" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("PRODUCTDATE" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("PRODUCTCODE" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("FACTORYADDRESS" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("BURDENSHEET" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("EXPIRATIONDATE" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("PACHING" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("BARCODE" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("ORGANISM" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("ORIGIN" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("PREFERENTIALPRICE" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("DISTRIBUTION" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("COURIERFEES" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("MONTHLYSALES" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("EVALUATION" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("INTRODUCTION" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("IMAGES" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("SHOPPRICE" IS NOT NULL);
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD CHECK ("NUMBERNO" IS NOT NULL);

-- ----------------------------
-- Primary Key structure for table TBL_SPECIALTY
-- ----------------------------
ALTER TABLE "JSD1710"."TBL_SPECIALTY" ADD PRIMARY KEY ("ID");
